## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/wayofthesys-cinema-363715/locations/us-central1/clusters/cinema"
        name                        = "cinema"
        # (27 unchanged attributes hidden)

!       node_pool {
            name                        = "core"
!           node_count                  = 4 -> 5
            # (6 unchanged attributes hidden)

            # (4 unchanged blocks hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] has changed
!   resource "google_container_node_pool" "pools" {
        id                          = "projects/wayofthesys-cinema-363715/locations/us-central1/clusters/cinema/nodePools/core"
        name                        = "core"
!       node_count                  = 4 -> 5
        # (9 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@wayofthesys-cinema-363715.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/wayofthesys-cinema-363715/serviceAccounts/external-dns@wayofthesys-cinema-363715.iam.gserviceaccount.com/keys/6fc646dc6db355ad09134641e436b47e40b89d05" -> (known after apply)
!       name               = "projects/wayofthesys-cinema-363715/serviceAccounts/external-dns@wayofthesys-cinema-363715.iam.gserviceaccount.com/keys/6fc646dc6db355ad09134641e436b47e40b89d05" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJQ2RpdDVjbTBHTTR3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQXpOVGswT0RRNU16RTBNams1TmpnM01EZzBNQ0FYRFRJeU1UQXhOVEF6TVRBeE1Gb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1ETTFPVFE0TkRrek1UUXlPVGsyT0Rjd09EUXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRREJ0L1ZzbWhTNjVqdS8yQmw0dFV1WlNlZjgKZXdDNlFodUE1Nnp3cExFbkcxUUpPWFp3S1Q4NzQvZUlNaldHTTc0YUpyODdkOE1wbCsydzRveHVETllxK1FqaApiRU8zM25TVGpEYXF0SmI0S3FiaVpSUlhDZjg3L1NhbzhqTzVmbnNkcUNSb2NrMEQ5YXNqVzZoZGhOWUdxd09sCmxrY3JEZTMzYmh2NUVKWk1CZm40cVRLMnhWeHFkUitPSmN1QkFGVWkySjVrYTZXVjRXc0ZGVHZuMndBb0hHN2wKSE1hQ3U5eEtLUmtTZzExMmF5cm1KK043UW5EaVg1Y2NvOE5nNmxDbndvM0x0OFNsR1JmVFZXUC9UOWw1NUJ6dApRMjF6WjNuRHFNNHlPVEFQVzAzZjB1TzBLcVVncDh3SXQ0RHJmazU4Ty8rWlVKYVR4akpUZmVCOFJZdUxBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQ2xlYjV0eFUyLzNZbjVZR3I5eUZKUAozdmNuL3FRWkwyeExNY2JGYmtjMlJ0YTFsamhQT1JWK3BaV2c1UWFrQ0RRZnhtYjhRbVRDZDl0UXNwenZ5WjBsClU0d0kyQ2lOTDNnZmhNZW9GbEQ4UlJ2bnRLbXNsQ25yWmFOelRGL0ozOVBSREpwY2gxaTRMUUNNZXh0WXU0TEkKeHpJT0ZYUU9Ea2grWWhpOFpVQ255VG1ESW5yNlk1cmp0WXhkZS9oa0cwcFh1b1pXdi9iODdxRDZsWkp2RTNPVgo5TFhLanJKR2VTQm15WVZpWWljblptZDIyc2ZOblpyOUNjb3ZDc2xCVEl3OXNqdkNiYnp2OEhmM09hS1BXMXlCCkNFdWhXc3BaN2tQUXB1K3dPTStOREpEME0xUjQ2ZkRoOFk1M2hXQWFreUw3M0s3V2xVY3ZmNmtxaEo3ZUhSaXMKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/wayofthesys-cinema-363715/serviceAccounts/external-dns@wayofthesys-cinema-363715.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-10-15T03:10:10Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.cloud-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "cloud-dns-credentials" {
!       data                           = (sensitive value)
        id                             = "cert-manager/gke-cloud-dns"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data                           = (sensitive value)
        id                             = "external-dns/external-dns"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
!       id                          = "projects/wayofthesys-cinema-363715/locations/us-central1/clusters/cinema/nodePools/core" -> (known after apply)
!       instance_group_urls         = [
-           "https://www.googleapis.com/compute/v1/projects/wayofthesys-cinema-363715/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-ae9685aa-grp",
        ] -> (known after apply)
!       managed_instance_group_urls = [
-           "https://www.googleapis.com/compute/v1/projects/wayofthesys-cinema-363715/zones/us-central1-a/instanceGroups/gke-cinema-core-ae9685aa-grp",
        ] -> (known after apply)
!       max_pods_per_node           = 65 -> (known after apply)
        name                        = "core"
+       name_prefix                 = (known after apply)
!       node_count                  = 5 -> (known after apply)
+       operation                   = (known after apply)
!       version                     = "1.24.5-gke.600" -> (known after apply)
        # (5 unchanged attributes hidden)

!       autoscaling {
-           total_max_node_count = 0 -> null
-           total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

!       node_config {
!           disk_size_gb      = 10 -> 20 # forces replacement
+           min_cpu_platform  = (known after apply)
            tags              = [
                "gke-cinema",
                "gke-cinema-core",
            ]
!           taint             = [] -> (known after apply)
            # (11 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.gke_auth.data.google_container_cluster.gke_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "gke_cluster" {
+       addons_config                     = (known after apply)
+       authenticator_groups_config       = (known after apply)
+       binary_authorization              = (known after apply)
+       cluster_autoscaling               = (known after apply)
+       cluster_ipv4_cidr                 = (known after apply)
+       confidential_nodes                = (known after apply)
+       database_encryption               = (known after apply)
+       datapath_provider                 = (known after apply)
+       default_max_pods_per_node         = (known after apply)
+       default_snat_status               = (known after apply)
+       description                       = (known after apply)
+       dns_config                        = (known after apply)
+       enable_autopilot                  = (known after apply)
+       enable_binary_authorization       = (known after apply)
+       enable_intranode_visibility       = (known after apply)
+       enable_kubernetes_alpha           = (known after apply)
+       enable_legacy_abac                = (known after apply)
+       enable_shielded_nodes             = (known after apply)
+       enable_tpu                        = (known after apply)
+       endpoint                          = (known after apply)
+       id                                = (known after apply)
+       initial_node_count                = (known after apply)
+       ip_allocation_policy              = (known after apply)
+       label_fingerprint                 = (known after apply)
+       location                          = "us-central1"
+       logging_config                    = (known after apply)
+       logging_service                   = (known after apply)
+       maintenance_policy                = (known after apply)
+       master_auth                       = (known after apply)
+       master_authorized_networks_config = (known after apply)
+       master_version                    = (known after apply)
+       mesh_certificates                 = (known after apply)
+       min_master_version                = (known after apply)
+       monitoring_config                 = (known after apply)
+       monitoring_service                = (known after apply)
+       name                              = (known after apply)
+       network                           = (known after apply)
+       network_policy                    = (known after apply)
+       networking_mode                   = (known after apply)
+       node_config                       = (known after apply)
+       node_locations                    = (known after apply)
+       node_pool                         = (known after apply)
+       node_version                      = (known after apply)
+       notification_config               = (known after apply)
+       operation                         = (known after apply)
+       private_cluster_config            = (known after apply)
+       private_ipv6_google_access        = (known after apply)
+       project                           = "wayofthesys-cinema-363715"
+       release_channel                   = (known after apply)
+       remove_default_node_pool          = (known after apply)
+       resource_labels                   = (known after apply)
+       resource_usage_export_config      = (known after apply)
+       self_link                         = (known after apply)
+       service_external_ips_config       = (known after apply)
+       services_ipv4_cidr                = (known after apply)
+       subnetwork                        = (known after apply)
+       tpu_ipv4_cidr_block               = (known after apply)
+       vertical_pod_autoscaling          = (known after apply)
+       workload_identity_config          = (known after apply)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 249.71 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 249.71 | 249.71|
| | **Total** | **0.00** | **249.71** | **249.71** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
